Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] Good Luck, Hero!.tmx
Source language: ko_kr
Languages: en_us

source: 에휴, 진짜 이게 뭐 하는 짓인지...
en_us: whew, what are we even doing...?

source: 아잇, 사람 말은 좀 끝까지 들어.
en_us: hey, come on, hear me out.

source: 내가 진짜 기억을 되찾을까 봐?
en_us: is it because i might regain my real memories?

source: 당신 손 빌릴 생각 전혀 없어.
en_us: i have no intention of asking you for anything...

source: 글.그림 송현주
en_us: story and art by hyunju song

source: 이것만 약속해주면
en_us: if you can promise me this,

source: 그런 말 안 했으면 좋겠다.
en_us: so i hope you stop saying things like that.

source: 쳇
en_us: tch

source: 기우뚱
en_us: lean

source: 지금 뭐 하는⋯?
en_us: just what are you doing right-

source: 너 몇 번 봤어.
en_us: i saw you a couple times.

source: 아, 죄송해요.
en_us: ah, apologies.

source: 자는 건가?
en_us: is she sleeping?

source: 이런 짓을...!
en_us: ...do something like this!

source: 야.
en_us: hey.

source: 어차피 전생인데 상관없⋯
en_us: but it’s in the past. it doesn’t matter anym-

source: 어쩔 수 없지.
en_us: but i guess i have no choice.

source: 마음에도 없는 소리를 하고 있네.
en_us: you don’t have to say what you don’t mean.

source: 생일파티 시작까지 약 1시간.
en_us: 1 hour before the birthday party

source: 반짝
en_us: sparkle

source: 그건 백영웅 씨가 만만하니까 그런 거 아닙니까.
en_us: isn’t it because you are an easy target, mr. baek?

source: ···이걸 일일이 다 꾸민 거야?
en_us: did you... decorate all this?

source: 뻣뻣...
en_us: stiff...

source: 가인이, 너···
en_us: ga-in, why...

source: 마왕님 즉위
en_us: the enthronement of my lord

source: 그래도 둘 다 신난 것 같으니 일단은 모른 척해줄⋯
en_us: still, since the two of them seem excited, i guess i can feign ignoran-

source: ⋯어어⋯
en_us: uhhh...

source: 환생?
en_us: reincarnation?

source: ⋯알았어요.
en_us: okay.

source: 슥..
en_us: reach...

source: 콕 콕
en_us: poke poke

source: 그래.
en_us: sure.

source: 영웅 오빠는 전생의 일과 최대한 연관되지 않는 편이 나아.
en_us: it’d be best for hero to stay far away from anything related to the past life.

source: 이게 뭐야.
en_us: what is this?

source: 백 비서님마저 이사님한테 업무 외로는 말을 한마디도 안 걸고⋯
en_us: mr. baek doesn’t even say a word to the director unless it’s for work.

source: 잘못하셨으면 사과를 해야죠.
en_us: if you did wrong by someone, you should apologize.

source: 뚜ㅡ
en_us: beep-

source: 생각해보니까 이사님 심정이 이해가 가더라고요.
en_us: after thinking about it, i understand how you must have felt.

source: 며칠 내내 감감무소식이고.
en_us: why didn’t you call for a few days?

source: 이거 놔!
en_us: let me go!

source: 물론 내가 욱해서 도연화 욕을 해버린 탓도 있지만 그래도 이상해⋯
en_us: of course, i talked badly about yeonhwa out of impulse, but that was still so strange...

source: 척
en_us: reach

source: 예전에는 신호 3번 울리기도 전에 받았는데.
en_us: he usually answered before the third ring in the past.

source: 마족VS인간 전쟁 시작
en_us: demon race vs humanity: the beginning of the war

source: 허 참, 저니까 이 정도까지 설득한 거지, 이사님 혼자였으면 턱도 없었을걸요!
en_us: come on, it’s because i’m me that i could coerce him this far. if it were you, director, he wouldn’t have budged an inch!

source: 헐?
en_us: what?

source: 용사?
en_us: warrior?

source: 아니, 이유도 같이 말해줘야죠⋯
en_us: i mean, shouldn’t you tell me the reason-

source: 하지만 안 했으면 아빠의 도움을 못 받았을 테니까 어쩔 수가⋯
en_us: but if i didn’t, i wouldn’t have gotten any help from dad...

source: 꿈속의 그분과 똑같은 모습.
en_us: he is the same as the one i saw in my dream.

source: 몰라.
en_us: dunno.

source: ⋯확답은 못 하겠는데.
en_us: i can’t promise i will.

source: 그래서 백영웅 씨군.
en_us: so, that’s why you chose mr. hero baek.

source: 향긋~
en_us: fragrant~

source: 나도 집에 가고 싶다고.
en_us: i want to go home too.

source: 너 슬슬 가라.
en_us: why don’t you get going soon?

source: 주스가 좋아, 우유가 좋아?
en_us: do you like juice or milk?

source: 아니, 나리야.
en_us: nari, stop.

source: 스륵
en_us: loose

source: 덜컹
en_us: CLUNK

source: 저, 저한테 왜 말을 걸고 싶어 해요⋯?
en_us: wh-why do they want to talk to me?

source: 삐질ꞏꞏꞏ
en_us: sweat...

source: 끼익-
en_us: creak

source: 너랑 붙어 있으면 이상한 소문만 자꾸 붙는데.
en_us: when i am around you, weird rumors keep circulating.

source: 용사의 환생체는 아직 죽을 때가 안 됐는데?
en_us: it’s not yet time for the warrior’s reincarnation to die.

source: 촤 악
en_us: slide

source: 화냈던 거.
en_us: for that angry outburst.

source: ⋯내가 원하는 것은 뭐든 해준다고?
en_us: he’ll do... anything i ask of him?

source: 으응.
en_us: okay.

source: 왜!
en_us: why?!

source: 오후 8:50
en_us: 8:50pm

source: 대신 헛짓거리했다가 들키면, 알죠?
en_us: but if you get caught doing something wrong, you know what happens, don’t you?

source: 가인이가 시키는 걸 하고, 동생 보살피고.
en_us: do what she tells you to do and take care of your brother.

source: 이 사람은 오죽할까 싶어서.
en_us: because even i couldn’t make things happen the way i wanted them to.

source: 나는 복수의 '복' 자도 떠올리지 못한 채 유년 시절을 보냈다.
en_us: i spent my childhood without even thinking of the ‘r’ in revenge.

source: 슬픈 일이지.
en_us: it’s sad.

source: 갑자기 둘이 이렇게 엮인다고?
en_us: this is how their lives reconnect?

source: 하지만 저, 가인이랑 10년 넘게 알던 사이에요.
en_us: but, look... i’ve known ga-in for over 10 years now.

source: 내가 과민 반응 했다는 거 알고 있어요.
en_us: i know i overreacted.

source: 헉, 어디에요?
en_us: oh no... where?

source: 끼익
en_us: creak

source: 이사님이 저를 한두 번 실망시킨 줄 아십니까?
en_us: don’t you know how many times you’ve disappointed me?

source: 시치미 뗄 시간도 안 주고.
en_us: you didn’t even give me any time to make excuses.

source: 위로 쓸어 올려서 잠금 해제
en_us: slide up to unlock

source: 그런데··· 너 혼자 있는 거야?
en_us: anyway... is it just you here?

source: 이번 주 안에는 다 도착할 것 같아요.
en_us: i think they’ll be here within this week.

source: 악!
en_us: agh!

source: 어떤 기사님이 숲속에서 길을 잃은 나를 구해주는 꿈을 계속 꿔.
en_us: ...of a warrior rescuing me from a forest while i was lost.

source: 이 자식들이ꞏꞏꞏ!
en_us: you bastards...!

source: 그게 나의 두 번째 신분이었다.
en_us: that is my second identity.

source: 이거 애들이 잘 먹는다는데 보내줄게
en_us: i heard kids like these. i’ll send some to you.

source: 어디 가신 거예요, 백 비서님~!
en_us: where did you go, mr baek?!

source: 지끈
en_us: throb

source: 시끌
en_us: murmur

source: 보고 내용도 묘하게 부실해졌고⋯
en_us: his reports have become somewhat vague too...

source: 사탕?
en_us: candy?

source: 쉬익
en_us: slash

source: 그런데⋯
en_us: but...

source: 갑자기 한가해지니깐 적응 안 되네.
en_us: i can’t get used to not having anything to do so suddenly...

source: 아니, 그리고요.
en_us: oh, and one more thing.

source: 하지만 자세히 말해주기는 싫어요.
en_us: but... i don’t want to give you the details.

source: 지이잉-
en_us: buzz-

source: 여보세요, 서한결?
en_us: hello? hangyeol?

source: 딱 봐도 갚을 능력 없는 사람 협박해봤자 나올 게 뭐가 있다고.
en_us: even at a glance, he doesn’t look like he can repay it. what are you trying to accomplish by threatening him?

source: 여보세요?
en_us: hello?

source: 팔랑-
en_us: flap-

source: 뭐라는 거야.
en_us: what are you saying?

source: 항복할게.
en_us: you win.

source: 덜
en_us: tremble

source: 나한테 동기가 있었으면 대룡그룹을 더 쉽게 떠넘길 수 있었을 텐데⋯
en_us: if i just had a sibling or two, i could have handed over the responsibilities of dragon group to them.

source: 도연화가 생일에 약속을 잡았다는 말을 난생처음 들었는데 당연히 좋아야지.
en_us: yeonhwa do having plans on her birthday. that’s the first time i’ve ever heard that. of course it’s very good.

source: 내가 어이가 없어서⋯
en_us: what even in the...

source: 58번 손님, 주문하신 음료 나왔습니다~
en_us: number 58, your food is ready!

source: 단련된 기사들도 겨우 견디는 수준입니다.
en_us: even trained soldiers can barely withstand the environment.

source: 대충 제가 용서했다 치고 넘어갑시다.
en_us: let’s just say i forgave you and move on.

source: 나한테 줘봤자 뭘 한다고⋯
en_us: what would i even do with him...?

source: 도와달라고?
en_us: you want me to help?

source: 네?
en_us: what?

source: 말 심하네···
en_us: that’s a bit harsh...

source: 오빠가 일부러 고친 건가?
en_us: did he do it on purpose?

source: 생일 파티 해야 하는데 분위기 어색하면 어떡해.
en_us: we’re throwing a party... what if it gets awkward?

source: 치이⋯
en_us: tsk...

source: 진짜 문제는 이 이후부터 시작되긴 하지만ꞏꞏꞏ
en_us: although, the real problem started after that...

source: ⋯그렇다고 그 애를 평생 가둬둘 수는 없잖아요.
en_us: but... that doesn’t mean we can hold him here forever.

source: 이쯤 되면 모른 척하는 것도 민망하다⋯
en_us: at this point, it’s embarrassing to keep pretending...

source: 차가 못 들어오니까 걸어가야 한다는 건 거짓말이 아니었구나.
en_us: it’s impossible for cars to fit through the area. i guess he wasn’t lying when he said we needed to walk here.

source: 이사님, 자기 사람들한테 잘해주면 잘해줬지 소홀하지는 않아.
en_us: director’s do... she’s been anything but neglectful of her people.

source: 기쁘긴 한데 좀 서운하다.
en_us: i’m happy but also a little sad...

source: 도연화 이사, 백영웅 비서
en_us: director yeonhwa do, and secretary hero baek

source: 아빠가 사과할게.
en_us: my apologies, daughter.

source: 으에에에엥?!
en_us: huuuuh?!

source: 너무해요, 삼촌.
en_us: uncle, you are too cruel.

source: 이쁘다!
en_us: so prettyyy!

source: 나 대체 언제 이렇게까지 물러진 거지⋯
en_us: when did i become this malleable...?

source: 한 번만 더 물어봐주라.
en_us: ask one more time.

source: 뚜르르르-
en_us: riiing-

source: 한울이 지금 현장 학습 가서 집에 없어.
en_us: hanul is on a field trip right now, so he’s not home.

source: 빠안~
en_us: stare

source: 이걸 어쩐다.
en_us: well, that’s a problem.

source: 넌 좀 단순하게 생각할 필요가 있다니까.
en_us: i feel like a lack of overthinking might do you some real good.

source: 생일 기념으로 맛있는 거 사줄까?
en_us: may i treat you to a delicious meal for your birthday?

source: 어떻게
en_us: how could you...

source: 생각보다 싱겁네.
en_us: that was more anticlimactic than expected.

source: 그리고 동시에 깨달았다.
en_us: at the same time, i had another realization.

source: 슥
en_us: pat

source: 으!
en_us: ugh!

source: 좀 더 왼쪽이요.
en_us: a little more to the left.

source: 남을 앞에 내세워 많은 일을 저질렀다.
en_us: i used him to carry out my revenge.

source: 혹시 동생 영양제 같은 거 먹어?
en_us: does your brother eat any nutritional supplements?

source: 비서팀에게는 업무가 하나 더 추가된다.
en_us: one more task gets added to the secretarial team.

source: 금방 돌아올게요!
en_us: i’ll be back soon!

source: 사장님이 너한테 약하거든.
en_us: my boss... she gets weak when it comes to you.

source: ⋯안 둬!
en_us: -after you!

source: 백영웅, 부재중.
en_us: hero baek, absent.

source: 나한테 잘해주려고 노력하시는 것 같긴 한데⋯
en_us: the director is trying to treat me well...

source: 툭
en_us: thunk

source: 건들⋯
en_us: touch-

source: 그 대신 부탁하고 싶은 게 있어.
en_us: but in exchange, i want to ask you for a favor.

source: 이 벅차오름 대체 뭐지?
en_us: what’s this feeling?

source: 게다가 전생의 나와 알던 사이 였다고⋯?
en_us: on top of that, we knew each other in our past lives...?

source: 안 돼.
en_us: no.

source: 싫어!
en_us: no!

source: 문전박대 대박⋯
en_us: wow, suuuch a warm welcome...

source: 뭐가 좋다는 거야.
en_us: what’s good?

source: 가인 씨, 스탠바이 할게요~
en_us: ms. jeong, you are on stand-by!

source: 너 지금 어디야.
en_us: where are you right now?

source: 서한결 어쨌냐고!
en_us: i said, what the hell did you do with hangyeol seo?!

source: 그 애는 유치한 걸 좋아하니까...
en_us: after all, she likes childish things...

source: 지
en_us: thr

source: 빠른 용서!
en_us: a quick forgiveness!

source: 꼭 저여야만 한다고 어찌나 강조하던지~
en_us: he was so insistent that it haaad to be me.

source: 정말이지ꞏꞏꞏ
en_us: for crying out loud...

source: 서한결 씨한테 꼬리 하나만 붙여줄 수 있어요?
en_us: can you put a tail on mr. seo?

source: 상처 치료하고 갈아입을 옷도 줄게요.
en_us: we’ll treat your wounds first. then, i’ll give you something to change into.

source: 그건 아까 말했⋯
en_us: i already sai-

source: 한결이 형!
en_us: hangyeol!

source: 완전 처음 듣는 얘기라고.
en_us: that’s the first time I’ve ever heard anything like that.

source: 나한테 동생이 있는 걸 알고 있어.
en_us: he knows i have a younger brother.

source: 저는 그냥 제 일을 했을 뿐인데⋯
en_us: i just did my job...

source: 아
en_us: e

source: 네에.
en_us: fine.

source: 많이 다쳤어요?
en_us: are you hurt?

source: 근데 저거 뭐야?
en_us: hey, what’s that?

source: 파 삭
en_us: crack

source: 용서 못 해.
en_us: i won’t forgive her.

source: 도연화 신경 쓸 시간이 부족해.
en_us: i don’t have enough time to worry about yeonhwa.

source: 깜짝 파티 아이디어 낸 사람은 백 비서님 이었잖아요.
en_us: you were the one who suggested the surprise party idea.

source: 문자 답장은 왜 안 해요?
en_us: and why didn’t you answer your text messages?

source: 드르륵-
en_us: drag-

source: 이사님은 왜 퇴근 안 하십니까?
en_us: why aren’t you going home?

source: 너 이...!
en_us: y-you...!

source: 다 세팅 해뒀습니다.
en_us: everything’s all set up.

source: 나도 이 짓 그만하고 빨리 너 풀어주고 싶거든?
en_us: i want to stop doing this and let you go too, you know?

source: 그 아저씨가 너 먹으라고 사준 거야.
en_us: he’s the one who bought it for you.

source: 금방 오실 거니까 우리 조금만 기다려요!
en_us: he’ll be back soon, so let’s wait a bit!

source: 까불 거 다 까불어놓고 이제 와서 뭐, 말이 심해?
en_us: you call me harsh? when you are the one who stepped over his boundaries over and over again?

source: 아닌데.
en_us: no way...

source: 여기 인별에서 유명해요.
en_us: it’s famous on instar.

source: 느이 아버지가 우리 회사에서 일했었다는 건 알고 있지?
en_us: did you know your old man was working for our company before?

source: 무슨 뜻이지?
en_us: what does that mean?

source: 누구세요?
en_us: who is it?

source: 새삼스럽게⋯ 도연화 그거 까탈스러운 거 한두 번 보나.
en_us: come on now... it’s not like yeonhwa’s never been prickly before.

source: 그게ꞏꞏꞏ
en_us: the thing is...

source: 이사님⋯
en_us: it feels like...

source: 아, 빨리!
en_us: oh, come on!

source: 왜 미안한데요?
en_us: why are you sorry?

source: 그러니까 담에 만나면 고맙습니다, 해.{j}
en_us: next time when you see him, tell him thank you.

source: 쓸데없는 일을 벌인다고 생각했었는데.
en_us: i thought they were doing something useless.

source: 얘들아, 묶어라.
en_us: hey y’all, tie him up.

source: 한 번뿐?
en_us: once?

source: 솔직히 그렇잖냐.
en_us: whether it’s your holding hostage,

source: 뭘 미안해 하고 있어요?
en_us: what are you apologizing for?

source: 이걸 어쩌나, 이사님과는 절대 말 안 할 거라는데요.
en_us: well, that’s going to be a problem. he said he won’t say anything to you, director.

source: 커피만 마시지 말고 케이크 같은 거 사 드세요.
en_us: don’t just drink coffee. get yourselves some cakes or something.

source: 착한 아이 '정가인'이라면 절대 못 했을 일들.
en_us: things that the good child ‘ga-in jeong’ could never do.

source: 막상 이사님 앞에 서면
en_us: ...but when i stand in front of her,

source: 드라마를 괜히 한다고 했나?
en_us: was it a mistake to join the drama series?

source: 냄새가 난다, 냄새가 나⋯
en_us: oooh, there’s something in the air~

source: 접니다.
en_us: it’s me.

source: 아무래도 이 친구 교육 좀 받아야ꞏꞏꞏ
en_us: i think our friend here needs some-

source: 하여간 용사 손까지 빌려서 환생한 보람이 없다.
en_us: it really wasn’t worth using the warrior like that to reincarnate so far.

source: 가인이
en_us: ga-in

source: 저 부탁드리고 싶은 게 하나 있어서요.
en_us: i have a favor i want to ask of you.

source: 들어가자니까?
en_us: let’s go in.

source: 완벽주의 때문에 밑에 직원들 갈아 넣는 사람.
en_us: people who grind and neglect their employees to account for their perfectionistic natures.

source: 밀어서 통화하기
en_us: slide to answer

source: 다시 도연화를 몰아붙여야 하나?
en_us: do i have to corner her again?

source: 남은 건 시퍼렇게 어린 핏덩이 둘뿐이고ꞏꞏꞏ
en_us: and he left two young bloods in his stead...

source: 경악!
en_us: astonished!

source: 대룡 ENT 대표이사 도연화의 생일이 다가오면
en_us: every year, whenever the birthday of dragon ent’s director, yeonhwa do, comes around,

source: 가인아, 이쪽은 연화 언니야.
en_us: ga-in, this is yeonhwa.

source: 질투라도 해?
en_us: are you jealous?

source: 벌떡
en_us: stand

source: 백 비서님?!
en_us: mr. baek?!

source: 안 돼요.
en_us: no.

source: 이
en_us: r

source: 축하해요!
en_us: happy birthday!

source: 너 같은 사람들은 자선 사업을 하지 않잖아.
en_us: people like you don’t do charity work.

source: 이사님의 안전만큼 중요한 건 없는 걸요!
en_us: director, there’s nothing more important than ensuring your safety!

source: 어디로 갔어?!
en_us: where did he go?!

source: 괜찮죠?
en_us: is that okay?

source: 끼익..
en_us: creak

source: 가인아 뭐해?
en_us: ga-in, what are you up to?

source: 아⋯ 폰 놓고 왔나 본데?
en_us: ah... i think i left my phone somewhere.

source: 이번 생에서는 용사님을 빼앗기지 않을 수 있어!
en_us: ...then i won’t have my warrior taken away from me in this life!

source: 둘이 냉전 상태인 것 같다는 보고 들은 지 며칠이나 됐다고!
en_us: i thought they were on bad terms with each other!

source: 저도 무작정 그놈 말을 들어주는 건 반대예요.
en_us: i also disagree with just simply giving into his demand.

source: 후⋯
en_us: whew...

source: 내일 보죠.
en_us: i’ll see you tomorrow.

source: 내가 못 살아...!
en_us: for crying out loud!

source: 잊어버리지 않게 계속 알려줘야 한다고.
en_us: we have to keep reminding her so she doesn’t forget.

source: 번
en_us: fla

source: 정말 감사합니다, 공주님!
en_us: thank you so much, your highness!

source: 하아...
en_us: haaa...

source: 도연화 이사, 백영웅 비서와 함께 퇴근합니다
en_us: director yeonhwa do is getting off work with mr. hero baek.

source: 알았어.
en_us: okay.

source: 얼굴 보니까 알겠네.
en_us: i can tell by your face.

source: 아빠가 알아서 해줄 테니까 걱정하지 마라.
en_us: i’ll take care of it. just leave it to your dad, so don’t worry.

source: 컥!
en_us: ugh!

source: 어린애를 안 싫어하면 더 좋고.
en_us: it’d be even better if they don’t hate kids.

source: ⋯응, 가인아.
en_us: hi, ga-in...

source: 뭐어?
en_us: what?

source: 원하는 거 있으면 다 말해봐.
en_us: tell me what you want.

source: 오늘 쌀쌀하니까 밖에서 놀 때 겉옷 벗지 말고.
en_us: it’s cold today, so don’t take your clothes off when playing outside.

source: 끄 응...
en_us: groan...

source: 오늘도 어머니를 실망시키는 것에 실패했다.
en_us: today, i failed to disappoint my mother again.

source: 죄송합니다⋯
en_us: i’m sorry...

source: 음, 네.
en_us: yep.

source: 아, 저는 괜찮습니다!
en_us: ah, yes, i’m fine.

source: 아니, 그럼 어쩌자는 거예요?
en_us: what? then what do you suggest we do?

source: 새삼스럽게 실망할 필요 없⋯
en_us: there’s no reason to feel disappoin-

source: 늬예.
en_us: yeah, yeah.

source: 옆에 있으면 배울 것도 많고.
en_us: there is a lot to learn when i’m by her side, too.

source: 이런 건 어때.
en_us: how about something like this?

source: 풍선 불고, 붙이고···
en_us: i inflated some balloons, stuck them on...

source: 싸 아 아 아...
en_us: chill...

source: 가까운 곳부터 뒤졌어야 했는데 내가 너무 안일했지.
en_us: i should’ve searched nearby first, but i was too trusting.

source: 오늘따라 그게 진짜 짜증 나네.
en_us: ...but that aspect of you is really pissing me off today.

source: ⋯저번 생에 무슨 일이 있었는지는 말 안 해 주실 건가요?
en_us: ...are you not going to tell me about what happened in our past lives?

source: 힐끔
en_us: glance

source: 아이고, 이사님!
en_us: oh wow, director!

source: 이사니이임~!
en_us: directorrr!

source: 잘했어요!
en_us: good!

source: 빨리 퇴근하고 싶다고 얼굴에 대문짝만하게 붙여놨으면서⋯.
en_us: you wanting to go home is written all over your face...

source: 감동...
en_us: touched...

source: ⋯나 지금 잘하고 있는 거 맞겠지?
en_us: i hope i’m doing the right thing...

source: 제가 상대할 테니, 백영웅 씨는 빠지세요.
en_us: i’ll deal with him. you stay out of this, mr. baek.

source: 그게 다였다.
en_us: that was all.

source: 손해는 억 소리 나게 났는데 책임져야 할 사람은 코빼기도 안 보이고
en_us: our company suffered a great loss, but the one responsible is nowhere to be seen,

source: 너는 나랑 노는 거야.
en_us: because... you’re hanging out with me today.

source: 사장님한테 다 들켰다고!
en_us: my boss found out everything i was doing!

source: 딱 좋아요!
en_us: that’s perfect!

source: 안 그래도 심란해 죽겠는데!
en_us: for crying out loud, one thing after another!

source: - 43화 -
en_us: episode 43

source: 궁금해 죽겠네.
en_us: i’m so curious.

source: 버럭
en_us: blurt

source: 무슨 소리야?
en_us: what’s that sound?

source: 영웅 오빠한테 어디까지 불었어요?
en_us: how close have you gotten to hero?

source: 까톡 까톡
en_us: ding ding

source: 통화 종료
en_us: end call

source: 오빠도 도연화의 접점이 없는 지금 상태만 유지하면⋯
en_us: if i could just maintain the current situation where he stays away from yeonhwa...

source: 왜 안 쳤어?
en_us: why didn’t you hit me?

source: 가방 챙겼어?
en_us: did you get your backpack?

source: 릉
en_us: tup

source: 자, 일어나.
en_us: come on, get up.

source: 짜증 난 김에 우리 서로 좀 솔직해져 봅시다.
en_us: while we’re pissed off, let’s be a bit more honest with each other.

source: 그런데 범인이랑 대화하고 싶다는 태평한 소리 하는 것도 모자라서
en_us: on top of saying such a careless statement like wanting to talk to the culprit,

source: 쓸데없이 고지식하고 동정심이 많은 사람이지.
en_us: i need help from someone who’s needlessly stubborn and compassionate.

source: ⋯변해도 되는 걸까?
en_us: is it... okay for me to change?

source: 대체 뭔 일이다냐···
en_us: what happened...?

source: 말이 왜 안 돼.
en_us: what the hell do i mean... ha.

source: ⋯역시 말 안 해주세요.
en_us: you’re... really not going to tell me, are you?

source: 야, 놀라지 마.
en_us: don’t be surprised, okay?

source: 은연중에 기대해버렸다.
en_us: yet I still expected a different result each time.

source: 주스요⋯
en_us: i’ll take a juice...

source: 응.
en_us: okay.

source: 역시 준혁이, 쓸 만하다니깐.
en_us: oh jun, you know so much.

source: 이사님!
en_us: director!

source: 바본가...
en_us: is he stupid...?

source: 드르륵
en_us: DRAG

source: 별건 아니고⋯
en_us: it’s nothing big...

source: 그만 신경 쓰고 나는 내 할 일을 해야지⋯
en_us: i’ll stop worrying so much and focus on my work...

source: 하여간 대단하다니까.
en_us: it’s quite impressive.

source: 야!!
en_us: hey!!!

source: 먼저 화해 신호를 보내야겠다는 생각을 안 해본 건 아니지만
en_us: although, it’s not like i didn’t think about offering an olive branch first...

source: 잘됐네요.
en_us: good.

source: 우다다다다-
en_us: da da da da da

source: 자, 이제 합쳐봅시다.
en_us: all right, then let’s bring it all in together.

source: 너희 뭐야?!
en_us: who the heck are you guys?!

source: 쿵-
en_us: boom

source: 밥 사준다며!
en_us: you said you were buy me food!

source: 제가 얼마나 구질구질하고 끈질긴지.
en_us: you also know how stubborn and gritty i am.

source: 한결 씨는 마침 네 또래니까 말도 잘 통할 거고.
en_us: not to mention, mr. seo is around your age, so you can probably relate well.

source: 이⋯?
en_us: -ing?

source: 우리가 서태용이를 믿고 큰 건을 맡겼는데ꞏꞏꞏ
en_us: did you know we put taeyong in charge of a big business deal?

source: 아, 그냥 말해본⋯
en_us: ah, i’m just kiddi-

source: 그날 밤, 꿈을 꿨다.
en_us: that night, i dreamed.

source: 짠!
en_us: ta-da!

source: 덥석
en_us: grab

source: 나는 더한 짓도 저지를 수 있어.
en_us: ...i’m willing to do worse things.

source: 도연화, 이거 임자 만났구먼.
en_us: yeonhwa do, you’ve finally met your match, haven’t you?

source: 만나게 해서는 안 돼.
en_us: i must not let them meet.

source: 지금 당장은 가인이 볼 자신이 없어.
en_us: i don’t have the heart to see ga-in right now...

source: 끼
en_us: c

source: 현장 체험 학습 재미있어?
en_us: did you enjoy the field trip?

source: 됐다니까⋯ 그리고 선약 있어.
en_us: i said no. and... i already have a reservation.

source: 드아아아아앗!
en_us: ...gonna kiiiiiick!

source: ꞏꞏꞏ물론 그 사람이 나라는 건 아니고.
en_us: of course, i’m not saying that person is me...

source: 대룡 ENT라고, 거기 엔터 계열 신생 계열사야.
en_us: they have a new entertainment division known as dragon ent.

source: 저도 했으니까 공평하게 주고받읍시다.
en_us: i did it too, so let’s be fair and make it even.

source: 협조 좀 해, 인마.
en_us: cooperate with me here, jun.

source: 유약한 성정과 부모님의 과보호 탓에 또래와 잘 어울리지 못했던 나와는 달리
en_us: unlike me, who couldn't get along with my peers due to my shy demeanor and overprotection from my parents,

source: 쾅!
en_us: boom!

source: 그걸 좀 늦게 알아채긴 했지만⋯
en_us: although i did catch onto that a bit late...

source: 거짓말이지?
en_us: this can’t be true, right?

source: 사장님, 혹은 도연화 이사가 동생에게 관심을 보이거나.
en_us: by chance, if my boss or even director do starts showing interest in my brother...

source: 네, 아가씨.
en_us: yes, miss.

source: 마왕이 용사님을 집어삼킬 거야.
en_us: the demon lord is going to swallow the holy warrior whole!

source: 정확히는 가인이가 했던 말을 그 애가 옮긴 거지만.
en_us: to be exact, it was ga-in’s words. he was just the middleman.

source: 안 그래도 아까 밥 한번 먹자고 했다가 거절당했거든?
en_us: I’ve already been rejected once while trying to ask her out for dinner.

source: 아니.
en_us: nope.

source: 쉿, 아무 소리도 내지 마.
en_us: shhh, don’t say anything.

source: 고오오오..
en_us: grrr

source: 서···
en_us: su...

source: 그 사람은 도연화 이사를 끌어내리기 위해 수단과 방법을 가리지 않을 거야.
en_us: there is nothing she won’t do to bring down director do.

source: 어쨋든 내 부탁 들어주기로 한 거 맞지?
en_us: a-anyway! you agree to my demands, right?

source: 바빠??
en_us: are you busy?

source: ⋯이상해.
en_us: that was weird...

source: 어렵거든?
en_us: yes, it is!

source: 제가 말했었잖아요.
en_us: i told you before.

source: 올 게 없는데.
en_us: I’m not expecting anything.

source: 마왕을 향한 복수심을.
en_us: and even my vengeful heart towards the demon lord.

source: 네!
en_us: yeah!

source: 벌
en_us: cl

source: 하지만.
en_us: however.

source: 나는 됐어⋯
en_us: i’m okay...

source: 억
en_us: wack

source: 우와, 어려운 책투성이⋯
en_us: wow, so many difficult books...

source: 살금...
en_us: sneak...

source: 어라라.
en_us: wait...

source: 생각보다 별거 아니네.
en_us: it really was more anticlimactic than i thought.

source: 생각해보니까 나도 너한테 손 올릴 자격은 없는 것 같아서.
en_us: after thinking about it, i felt like i didn’t have any right to do so.

source: 파 바 바 바 밧
en_us: snatch snatch snatch

source: 내가 너무 잘해줬나?
en_us: did i treat him too well?

source: 우왓!
en_us: whoa!

source: 나 그래도 용사님과 꽤 친했다고 생각했는데···
en_us: i thought i was pretty close with the warrior...

source: 누구랑?
en_us: with who? where?

source: 변하는 게 뭐 어때서?
en_us: well, what’s wrong with changing?

source: 원래 남녀 사이에는 끼는 거 아니다⋯
en_us: well, it’s kind of a rule to not get between a man and a woman.
